# pandas

the series data structure

In [3]:
import pandas as pd
pd.Series?

In [4]:
animals=['tiger','bear','moose']
pd.Series(animals)

0    tiger
1     bear
2    moose
dtype: object

In [6]:
numbers=[1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [7]:
animals=['tiger','bear',None]
pd.Series(animals)
#it returns None as an object

0    tiger
1     bear
2     None
dtype: object

In [8]:
numbers=[1,2,None]
pd.Series(numbers)
#here it returns None as NaN (no a number)a special float

0    1.0
1    2.0
2    NaN
dtype: float64

In [9]:
import numpy as np
np.NaN==None

False

In [10]:
np.NaN==np.NaN

False

NaN is a special float 
we cant do the equality test directly
we need a speial function 'isnan'

In [12]:
np.isnan(np.NaN)

True

In [15]:
sports={'archery':'Bhutan',
        'Golf':'Scotland',
        'Sumo':'Japan',
         'Taekwando':'South korea'}
s=pd.Series(sports)
s

archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwando    South korea
dtype: object

In [17]:
s.index
#get the index by using index attribute

Index(['archery', 'Golf', 'Sumo', 'Taekwando'], dtype='object')

In [19]:
s=pd.Series(['Tiger','Bear','Moose'],index=['India','America','Canada'])
s
#series can also be defined by giving index in te form of list

India      Tiger
America     Bear
Canada     Moose
dtype: object

#querying a data

In [20]:
sports={'archery':'Bhutan',
        'Golf':'Scotland',
        'Sumo':'Japan',
         'Taekwando':'South korea'}
s=pd.Series(sports,index=['Golf','Sumo','Hockey'])
s
#returns NaN for the null object

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

In [25]:
s.loc['Golf']
#loc attribute is used for row selection

'Scotland'

In [26]:
sports={'archery':'Bhutan',
        'Golf':'Scotland',
        'Sumo':'Japan',
         'Taekwando':'South korea'}
s=pd.Series(sports)
s

archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwando    South korea
dtype: object

In [27]:
s.iloc[3]
#iloc attribute is used to access a data with index number

'South korea'

In [28]:
s[3]

'South korea'

In [29]:
s['Golf']

'Scotland'

In [30]:
sports={99:'Bhutan',
        100:'Scotland',
        101:'Japan',
         102:'South korea'}
s=pd.Series(sports)
s

99          Bhutan
100       Scotland
101          Japan
102    South korea
dtype: object

In [31]:
s[0]
#this wont call s.iloc[0]as one might expect ,it generates an error instead.

KeyError: 0

In [32]:
s=pd.Series([100.0,120.0,101.0,3.0])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [35]:
total=0

for item in s:
    total+=item
    
total
    #it works but it is a bit slower

324.0

In [34]:
import numpy as np
total=np.sum(s)
total
#this method is  faster

324.0

In [37]:
s=pd.Series(np.random.randint(0,1000,10000))
s.head()
#creates big series of random numbers

0    109
1    142
2    333
3    887
4    718
dtype: int32

In [38]:
len(s)

10000

timeit is magic function used to calculate the time taken to execute the function.

In [39]:
%%timeit -n 100

summary=0
for item in s:
    summary+=item
    
 
#here 100 shows number of loops

1.21 ms ± 22 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [41]:
%%timeit -n 100

summarry=np.sum(s)

88.1 µs ± 11.2 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

this proves that the second method is much faster than the firstone

In [43]:
s=pd.Series([1,2,3])
s.loc['Animals']='Bears'
s


#mixed type of data values are no problem for pandas

0              1
1              2
2              3
Animals    Bears
dtype: object

#The DataFrame Datastructure

In [2]:
import pandas as pd

purchase_1=({'name':'chris',
             'item purchased':'dog food',
             'cost':22.50})
purchase_2=({'name':'kevyin',
             'item purchased':'kitter litter',
             'cost':2.50})
purchase_3=({'name':'vinod',
             'item purchased':'bird seed',
             'cost':5.00})
df=pd.DataFrame([purchase_1,purchase_2,purchase_3],
                index=['store 1','store 1','store 2'])
df

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5
store 2   vinod      bird seed   5.0

In [3]:
df.loc['store 2']

name                  vinod
item purchased    bird seed
cost                      5
Name: store 2, dtype: object

In [4]:
type(df.loc['store 2'])

pandas.core.series.Series

In [5]:
df.loc['store 1']

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5

In [6]:
df.loc['store 1','cost']

store 1    22.5
store 1     2.5
Name: cost, dtype: float64

In [7]:
df.T

                 store 1        store 1    store 2
name               chris         kevyin      vinod
item purchased  dog food  kitter litter  bird seed
cost                22.5            2.5          5

In [8]:
df.T.loc['cost']

store 1    22.5
store 1     2.5
store 2       5
Name: cost, dtype: object

In [9]:
df['cost']

store 1    22.5
store 1     2.5
store 2     5.0
Name: cost, dtype: float64

In [10]:
df.loc['store 1']['cost']
#chaining returns copy of the data instead of view of the data

store 1    22.5
store 1     2.5
Name: cost, dtype: float64

In [12]:
df.loc[: ,['name','cost']]
#.loc attribute also supports slicing

           name  cost
store 1   chris  22.5
store 1  kevyin   2.5
store 2   vinod   5.0

In [13]:
df.drop('store 1')
#drops store 1

          name item purchased  cost
store 2  vinod      bird seed   5.0

In [14]:
df

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5
store 2   vinod      bird seed   5.0

In [16]:
copy_df=df.copy()
copy_df=copy_df.drop('store 1')
copy_df

          name item purchased  cost
store 2  vinod      bird seed   5.0

In [17]:
df

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5
store 2   vinod      bird seed   5.0

In [18]:
copy_df.drop?

In [23]:
del copy_df['cost']
copy_df
#deletes the column name cost

        item purchased
store 2      bird seed

#DataFrame Indexing and loading

In [26]:
purchase_1=({'name':'chris',
             'item purchased':'dog food',
             'cost':22.50})
purchase_2=({'name':'kevyin',
             'item purchased':'kitter litter',
             'cost':2.50})
purchase_3=({'name':'vinod',
             'item purchased':'bird seed',
             'cost':5.00})
df=pd.DataFrame([purchase_1,purchase_2,purchase_3],
                index=['store 1','store 1','store 2'])
df

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5
store 2   vinod      bird seed   5.0

In [28]:
df.T

                 store 1        store 1    store 2
name               chris         kevyin      vinod
item purchased  dog food  kitter litter  bird seed
cost                22.5            2.5          5

In [37]:
df

           name item purchased  cost
store 1   chris       dog food  22.5
store 1  kevyin  kitter litter   2.5
store 2   vinod      bird seed   5.0

In [38]:
df['location']=None
df
#adding a new column

           name item purchased  cost location
store 1   chris       dog food  22.5     None
store 1  kevyin  kitter litter   2.5     None
store 2   vinod      bird seed   5.0     None

In [41]:
df.T

                 store 1        store 1    store 2
name               chris         kevyin      vinod
item purchased  dog food  kitter litter  bird seed
cost                22.5            2.5          5
location            None           None       None

#practise with real world data

In [2]:
import pandas as pd


df=pd.read_csv('olympics.csv')
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [3]:
df=pd.read_csv('olympics.csv',index_col=0,skiprows=1)
df
#removes first row and first column

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

In [4]:
df.columns
#returns columns

Index(['№ Summer', '01 !', '02 !', '03 !', 'Total', '№ Winter', '01 !.1',
       '02 !.1', '03 !.1', 'Total.1', '№ Games', '01 !.2', '02 !.2', '03 !.2',
       'Combined total'],
      dtype='object')

In [7]:
for col in df.columns:
    if col[:2]=='01' :
        df.rename(columns={col:'Gold'+col[4:]},inplace=True)
    if col[:2]=='02' :
        df.rename(columns={col:'Silver'+col[4:]},inplace=True)
    if col[:2]=='03' :
        df.rename(columns={col:'Bronze'+col[4:]},inplace=True)
    if col[:1]=='№' :
        df.rename(columns={col:'#'+col[1:]},inplace=True)
        
        
df.head()

#renaming multiple columns at once

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

#Querying a DataFrame

In [9]:
df['Gold']>0
#boolean mask
#returns the countries who won gold

Afghanistan (AFG)                               False
Algeria (ALG)                                    True
Argentina (ARG)                                  True
Armenia (ARM)                                    True
Australasia (ANZ) [ANZ]                          True
                                                ...
Independent Olympic Participants (IOP) [IOP]    False
Zambia (ZAM) [ZAM]                              False
Zimbabwe (ZIM) [ZIM]                             True
Mixed team (ZZX) [ZZX]                           True
Totals                                           True
Name: Gold, Length: 147, dtype: bool

In [11]:
only_gold=df.where(df['Gold']>0)
only_gold
#countries which did not meet the condition have NaN data

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Independent Olympic Participants (IOP) [IOP],NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Zambia (ZAM) [ZAM],NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Zimbabwe (ZIM) [ZIM],12.0,3.0,4.0,1.0,8.0,1.0,0.0,0.0,0.0,0.0,13.0,3.0,4.0,1.0,8.0
Mixed team (ZZX) [ZZX],3.0,8.0,5.0,4.0,17.0,0.0,0.0,0.0,0.0,0.0,3.0,8.0,5.0,4.0,17.0
Totals,27.0,4809.0,4775.0,5130.0,14714.0,22.0,959.0,958.0,948.0,2865.0,49.0,5768.0,5733.0,6078.0,17579.0

In [12]:
only_gold['Gold'].count()


#returns the number of countries with gold medals

100

In [13]:
df['Gold'].count()

#returns the total number of countries

147

In [16]:
only_gold=only_gold.dropna()
only_gold.head()

#drops the rows with no data

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0
Australia (AUS) [AUS] [Z],25.0,139.0,152.0,177.0,468.0,18.0,5.0,3.0,4.0,12.0,43.0,144.0,155.0,181.0,480.0

Indexing DataFrames

In [17]:
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [18]:
df['country']=df.index
df=df.set_index('Gold')

In [20]:
df.head()
#returns the data with gold as index

,# Summer,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,country
Gold,,,,,,,,,,,,,,,
0,13,0,2,2,0,0,0,0,0,13,0,0,2,2,Afghanistan (AFG)
5,12,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria (ALG)
18,23,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina (ARG)
1,5,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia (ARM)
3,2,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia (ANZ) [ANZ]

In [22]:
df=df.reset_index()
df.head()
#resets previous index 
#returns default index

,index,Gold,# Summer,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,country
0,0,0,13,0,2,2,0,0,0,0,0,13,0,0,2,2,Afghanistan (AFG)
1,1,5,12,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria (ALG)
2,2,18,23,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina (ARG)
3,3,1,5,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia (ARM)
4,4,3,2,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia (ANZ) [ANZ]

#dealing with missing values

In [4]:
import pandas as pd

df=pd.read_csv('log.csv')
df.head()

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN     NaN
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN

In [5]:
df.fillna?

In [6]:
df=df.set_index('time')
df=df.sort_index()
df
#index sorted

              user          video  playback position paused  volume
time
1469974424  cheryl     intro.html                  5  False    10.0
1469974424     sue  advanced.html                 23  False    10.0
1469974454  cheryl     intro.html                  6    NaN     NaN
1469974454     sue  advanced.html                 24    NaN     NaN
1469974484  cheryl     intro.html                  7    NaN     NaN
1469974514  cheryl     intro.html                  8    NaN     NaN
1469974524     sue  advanced.html                 25    NaN     NaN
1469974544  cheryl     intro.html                  9    NaN     NaN
1469974554     sue  advanced.html                 26    NaN     NaN
1469974574  cheryl     intro.html                 10    NaN     NaN
1469974604  cheryl     intro.html                 11    NaN     NaN
1469974624     sue  advanced.html                 27    NaN     NaN
1469974634  cheryl     intro.html                 12    NaN     NaN
1469974654     sue  advanced.html                 28    NaN     5.0
1469974664  cheryl     intro.html                 13    NaN     NaN
1469974694  cheryl     intro.html                 14    NaN     NaN
1469974724  cheryl     intro.html                 15    NaN     NaN
1469974724     sue  advanced.html                 29    NaN     NaN
1469974754     sue  advanced.html                 30    NaN     NaN
1469974824     sue  advanced.html                 31    NaN     NaN
1469974854     sue  advanced.html                 32    NaN     NaN
1469974924     sue  advanced.html                 33    NaN     NaN
1469977424     bob     intro.html                  1   True    10.0
1469977454     bob     intro.html                  1    NaN     NaN
1469977484     bob     intro.html                  1    NaN     NaN
1469977514     bob     intro.html                  1    NaN     NaN
1469977544     bob     intro.html                  1    NaN     NaN
1469977574     bob     intro.html                  1    NaN     NaN
1469977604     bob     intro.html                  1    NaN     NaN
1469977634     bob     intro.html                  1    NaN     NaN
1469977664     bob     intro.html                  1    NaN     NaN
1469977694     bob     intro.html                  1    NaN     NaN
1469977724     bob     intro.html                  1    NaN     NaN

In [7]:
df=df.reset_index()
df=df.set_index(['time','user'])
df
#multiindex

                           video  playback position paused  volume
time       user
1469974424 cheryl     intro.html                  5  False    10.0
           sue     advanced.html                 23  False    10.0
1469974454 cheryl     intro.html                  6    NaN     NaN
           sue     advanced.html                 24    NaN     NaN
1469974484 cheryl     intro.html                  7    NaN     NaN
1469974514 cheryl     intro.html                  8    NaN     NaN
1469974524 sue     advanced.html                 25    NaN     NaN
1469974544 cheryl     intro.html                  9    NaN     NaN
1469974554 sue     advanced.html                 26    NaN     NaN
1469974574 cheryl     intro.html                 10    NaN     NaN
1469974604 cheryl     intro.html                 11    NaN     NaN
1469974624 sue     advanced.html                 27    NaN     NaN
1469974634 cheryl     intro.html                 12    NaN     NaN
1469974654 sue     advanced.html                 28    NaN     5.0
1469974664 cheryl     intro.html                 13    NaN     NaN
1469974694 cheryl     intro.html                 14    NaN     NaN
1469974724 cheryl     intro.html                 15    NaN     NaN
           sue     advanced.html                 29    NaN     NaN
1469974754 sue     advanced.html                 30    NaN     NaN
1469974824 sue     advanced.html                 31    NaN     NaN
1469974854 sue     advanced.html                 32    NaN     NaN
1469974924 sue     advanced.html                 33    NaN     NaN
1469977424 bob        intro.html                  1   True    10.0
1469977454 bob        intro.html                  1    NaN     NaN
1469977484 bob        intro.html                  1    NaN     NaN
1469977514 bob        intro.html                  1    NaN     NaN
1469977544 bob        intro.html                  1    NaN     NaN
1469977574 bob        intro.html                  1    NaN     NaN
1469977604 bob        intro.html                  1    NaN     NaN
1469977634 bob        intro.html                  1    NaN     NaN
1469977664 bob        intro.html                  1    NaN     NaN
1469977694 bob        intro.html                  1    NaN     NaN
1469977724 bob        intro.html                  1    NaN     NaN

In [9]:
df=df.fillna(method='ffill')
df
#forward filling method for missing values

                           video  playback position  paused  volume
time       user
1469974424 cheryl     intro.html                  5   False    10.0
           sue     advanced.html                 23   False    10.0
1469974454 cheryl     intro.html                  6   False    10.0
           sue     advanced.html                 24   False    10.0
1469974484 cheryl     intro.html                  7   False    10.0
1469974514 cheryl     intro.html                  8   False    10.0
1469974524 sue     advanced.html                 25   False    10.0
1469974544 cheryl     intro.html                  9   False    10.0
1469974554 sue     advanced.html                 26   False    10.0
1469974574 cheryl     intro.html                 10   False    10.0
1469974604 cheryl     intro.html                 11   False    10.0
1469974624 sue     advanced.html                 27   False    10.0
1469974634 cheryl     intro.html                 12   False    10.0
1469974654 sue     advanced.html                 28   False     5.0
1469974664 cheryl     intro.html                 13   False     5.0
1469974694 cheryl     intro.html                 14   False     5.0
1469974724 cheryl     intro.html                 15   False     5.0
           sue     advanced.html                 29   False     5.0
1469974754 sue     advanced.html                 30   False     5.0
1469974824 sue     advanced.html                 31   False     5.0
1469974854 sue     advanced.html                 32   False     5.0
1469974924 sue     advanced.html                 33   False     5.0
1469977424 bob        intro.html                  1    True    10.0
1469977454 bob        intro.html                  1    True    10.0
1469977484 bob        intro.html                  1    True    10.0
1469977514 bob        intro.html                  1    True    10.0
1469977544 bob        intro.html                  1    True    10.0
1469977574 bob        intro.html                  1    True    10.0
1469977604 bob        intro.html                  1    True    10.0
1469977634 bob        intro.html                  1    True    10.0
1469977664 bob        intro.html                  1    True    10.0
1469977694 bob        intro.html                  1    True    10.0
1469977724 bob        intro.html                  1    True    10.0